#include<iostream>

using namespace std;

const int N = 40;

int f[N][N]; //用二维数组表示状态，f[i][j] i表示当前传球次数，j表示当前球在第几号同学
int n,m; 

int main()
{
	cin >> n >>m;
	
	f[0][1] = 1; //还没开始传球时，第1号同学，传球方法数初始化为1 
	
	//考虑1号同学和n号同学的特殊处理
//题解
	for(int i=1;i<=m;i++)
	{
		//第一个同学 
		f[i][1] = f[i-1][2] + f[i-1][n];
		
		//中间的同学 
		for(int j=2;j<=n-1;j++)
		{
			f[i][j] = f[i-1][j-1] + f[i-1][j+1]; //球只可能从左边或者右边传过来，把左右的方法数加起来就是当前方法数 
		}
		
		//最后一个同学
		f[i][n] = f[i-1][n-1] + f[i-1][1]; 
	}  
	
	
//自己写的 
//	for(int i=1;i<=m;i++)
//	{
//		for(int j=1;j<=n;j++)
//		{
//			if(j == 1)
//			{
//				f[i][1] = f[i-1][2] + f[i-1][n]; 
//			}
//			else if(j == n)
//			{
//				f[i][n] = f[i-1][n-1] + f[i-1][1];
//			}
//			else 
//			{
//				f[i][j] = f[i-1][j-1] + f[i-1][j+1]; //球只可能从左边或者右边传过来，把左右的方法数加起来就是当前方法数 
//			}
//		}
//	} 
	
	cout << f[m][1] << endl;	
	return 0;
}
